app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = ''
 LIMIT 1
---
    public function valid_login()
    {
        //ambil data dari form
        $data = $this->request->getPost();

        //ambil data user di database yang usernamenya sama
        $user = $this->userModel->where('username', $data['username'])->first();

SELECT *
FROM `user`
WHERE `username` = ''
 LIMIT 1
---
    public function valid_loginG()
    {
        //ambil data dari form
        $data = $this->request->getPost();

        //ambil data user di database yang usernamenya sama
        $user = $this->userModel->where('username', $data['username'])->first();